#+title: Design and Implementation of the Aang Programming Language
#+LATEX_HEADER: \usepackage{semantic}
**** Back to parser
Simple parser combinations, we are not using the R type but instead we are overloading the operations
#+begin_src haskell

type Parser = Parsec Void String

:{
parseVar :: Parser Exists
parseVar = string "Var" *> space1 *> pure (Symantic Variable)
-- parseVariableSucc :: Parser Exists
-- parseVariableSucc = string "Succ" *> space1 *> pure (toDyn Abstraction)
-- parseAbstraction :: Parser Exists
-- parseAbstraction = string "Abstraction" *> space1 *> pure (toDyn Abstraction)
-- parseApplication :: Parser Exists 
-- parseApplication = string "Application" *> space1 *> pure (toDyn Application) 
-- parsePair :: Parser Exists
-- parsePair = string "Pair" *> space1 *> pure (toDyn Pair)   
-- parseFst :: Parser Exists
-- parseFst = string "Fst" *> space1 *> pure (toDyn Fst)   
-- parseSnd :: Parser Exists
-- parseSnd = string "Snd" *> space1 *> pure (toDyn Snd)     
-- parseUnit :: Parser Exists
-- parseUnit = string "Unit" *> space1 *> pure (toDyn Unit)
-- parseAang :: Parser Exists
-- parseAang = parseVar <|> parseVariableSucc <|> parseAbstraction <|> parseApplication <|> parsePair <|> parseFst <|> parseSnd <|> parseUnit
:} 
#+end_src

#+RESULTS:
: ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| 
: <interactive>:72:13-18: error: [GHC-76037]
:     Not in scope: type constructor or class ‘Parser’

